README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#orgcecc360)
2.  [Resumo e/ou informação extra:](#orgd025838)
3.  [Versão:](#org13c2b44)
4.  [Data:](#org1441794)
5.  [Autor de Contato:](#orgecabde8)
6.  [Lista dos Autores:](#org357c08a)
7.  [Áreas de pesquisa vinculadas:](#orgb5f65d4)
8.  [Vinculo com:](#orgda51c5b)
9.  [Paradigmas:](#orgb636909)
10. [Tipo de Interface:](#orgb80078c)
11. [Plataformas Suportadas:](#org05b607f)
12. [Linguagens Utilizadas:](#org909da29)
13. [Bibliotecas Utilizadas (dependências):](#org191b708)
14. [Softwares utilizados (dependências)](#orga4088dd)
15. [Tipo de Licença:](#org94aa3d2)
16. [Links:](#org4868243)


<a id="orgcecc360"></a>

# Nome do Software (ou Biblioteca):

-   DESENVOLVIMENTO DO SOFTWARE SIMULADOR DE SUBSTITUIÇÃO DE FLUIDOS E DE MODELAGEM AVO


<a id="orgd025838"></a>

# Resumo e/ou informação extra:

-   Realizar a substituição de fluidos para plotar um gráfico de velocidade da onda

compressional pela saturação de água e de velocidade da onda cisalhante pela
saturação de água .


<a id="org13c2b44"></a>

# Versão:

-   1.0.


<a id="org1441794"></a>

# Data:

-   2015/2 - segundo semestre.


<a id="orgecabde8"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org357c08a"></a>

# Lista dos Autores:

-   Maurı́cio Laurindo de Matos
-   Rafael Boechat Baptista Bastos de Oliveira
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgb5f65d4"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Geofísica
-   Petrofísica


<a id="orgda51c5b"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgb636909"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgb80078c"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org05b607f"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org909da29"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org191b708"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="orga4088dd"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org94aa3d2"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org4868243"></a>

# Links:

